In [1]:
#This is the functional Version. Use this for creating the report
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
#disable warnings
import warnings; warnings.simplefilter('ignore')

The source files for this script are SalesForce reports Interactions.Contacts.csv and Interactions.Opportunity.Term.csv. The source files have to be stored in a NON-GIT folder so that they will never be available to git hub. Whenever the source files are updated into box the old source files should be placed in a depreciated state in a different folder. This script therefore will always pull the most recent Salesforce report results.

In [3]:
#INT is the contact information for INTERACTIONS
INT=pd.read_csv('C:/Users/mjc341/Desktop/UMAN 1507 Monthly INQ summary Report/Interactions.Contacts.2.csv',skipfooter=5,encoding='latin-1',engine ='python')
#INT=pd.read_csv('C:/Users/sxh706/Desktop/Interactions.by.Month/2018/August/Interactions.Contacts1.csv',skipfooter=5,encoding='latin-1',engine ='python')

Please Use a new dataframe name if you are going to break any code

In [4]:
#CON is the CONTACT TERM information
CON=pd.read_csv('C:/Users/mjc341/Desktop/UMAN 1507 Monthly INQ summary Report/Interactions.Opportunity.Term.2.csv',skipfooter=5,encoding='latin-1',engine ='python')
#CON=pd.read_csv('C:/Users/sxh706/Desktop/Interactions.by.Month/2018/August/Interactions.Opportunity.Term.csv',skipfooter=5,encoding='latin-1',engine ='python')

In [5]:
len(INT)

1335940

In [6]:
len(CON)

322805

In [7]:
#INT.info()

In [8]:
INT.columns

Index(['Contact: Contact ID (18-digit)', 'Interaction: Interaction Name',
       'Admit Type', 'Contact: EMPLID', 'Contact: First Name',
       'Contact: Middle Name', 'Contact: Last Name', 'Contact: Ethnic Group',
       'Contact: Ethnicity', 'Contact: Gender', 'Term', 'Lead Source',
       'Interaction: Created Date', 'Contact: Mailing Street',
       'Contact: Mailing City', 'Contact: Mailing State/Province',
       'Contact: Mailing Zip/Postal Code', 'Contact: Mailing Country',
       'Contact: Other City', 'Contact: Other State/Province',
       'Contact: Other Zip/Postal Code', 'Contact: Other Country',
       'Contact: Market Segment Code', 'Contact: Market Segment'],
      dtype='object')

In [9]:
CON.columns

Index(['Contact ID (18-digit)', 'Full Name', 'Opportunity Name',
       'Term: Term Name', 'Opportunity Record Type', 'Inquiry', 'Inquiry Date',
       'Opportunity ID (18-digit)', 'Empl ID', 'Application Number'],
      dtype='object')

In [10]:
#CON.info()

In [11]:
#remove columns with identifing info
CON = CON.drop(columns =['Full Name'])

In [12]:
#remove columns with identifing info
INT = INT.drop(columns= ['Contact: First Name', 'Contact: Middle Name',
       'Contact: Last Name'])

In [13]:
#changed the name of columns using a dictionary
INT = INT.rename(columns ={'Contact: Contact ID (18-digit)':'Contact_ID','Interaction: Interaction Name':'Int_Name',
       'Admit Type':'Admit_Type','Contact: EMPLID': 'EMPLID','Contact: Ethnic Group': 'Ethnic_Group', 'Contact: Ethnicity':'Ethnicity',
       'Contact: Gender':'Gender', 'Term':'Term', 'Lead Source':'Lead_Source', 'Interaction: Created Date':'Create_Date',
       'Contact: Mailing Street':'Mailing_Street', 'Contact: Mailing City':'Mailing_City',
       'Contact: Mailing State/Province':'Mailing_State', 'Contact: Mailing Zip/Postal Code':'Mailing_Postal',
       'Contact: Mailing Country':'Mailing_Country', 'Contact: Other City':'Other_City',
       'Contact: Other State/Province':'Other_State', 'Contact: Other Zip/Postal Code':'Other_Postal',
       'Contact: Other Country':'Mailing_Country', 'Contact: Market Segment Code':'Market_Segment_Code',
       'Contact: Market Segment':'Market_Segment'},inplace =False)

In [14]:
#changed the name of columns
CON = CON.rename(columns={  'Contact ID (18-digit)':'Contact_ID', 'Opportunity Name':'OppName', 
       'Term: Term Name':'CONTerm', 'Opportunity Record Type':'Record_Type', 'Inquiry':'Inquiry', 'Inquiry Date':'Inquiry_Date',
       'Opportunity ID (18-digit)':'Opp_ID', 'Empl ID':'EMPL', 'Application Number':'App_Number'})

In [15]:
#Sort INT by Contact_ID and Interaction Names
INT = INT.sort_values(by = ['Contact_ID','Int_Name'])

In [16]:
#Sort CON by Contact_ID and Opportunity Name
CON = CON.sort_values(by = ['Contact_ID','Inquiry_Date'])

In [17]:
#Dropping the duplicates to then merge later
CON=CON.drop_duplicates(['Contact_ID'], keep='last')

In [18]:
#Inner Join
INNER_INT = pd.merge(left = INT, right = CON, left_on= 'Contact_ID', right_on = 'Contact_ID')

In [19]:
len(INNER_INT)

475088

INT has been MERGED with CON on Contact_ID this will allow us to find one TERM for each contact ID

In [20]:
INNER_INT.head(1)

,Contact_ID,Int_Name,Admit_Type,EMPLID,Ethnic_Group,Ethnicity,Gender,Term,Lead_Source,Create_Date,...,Market_Segment_Code,Market_Segment,OppName,CONTerm,Record_Type,Inquiry,Inquiry_Date,Opp_ID,EMPL,App_Number
0,0031500001d4Si8AAE,20160320-0100599,New Student,NaN,NaN,NaN,Female,Fall 2015,Purchased List,1/4/2013,...,NaN,NaN,fernandez - Fall 2017,Fall 2017,UGrad Inquiry,1,3/21/2016,0061500000T62QTAAZ,NaN,NaN

INNER_INT now has a nested tuple multiple index as a result of the merge. Have to create a unique key and replace the index

In [138]:
INNER_INT.Contact_ID.duplicated().sum()

172067

In [139]:
r= len(INNER_INT)
r

475088

In [140]:
N = list(range(0,r))
INNER_INT['NEW'] = N
INNER_INT['NEW'] = INNER_INT['NEW'].astype(str)
INNER_INT['NEW'].dtype

dtype('O')

In [24]:
INNER_INT['NEW_INDEX'] = INNER_INT['Contact_ID']+INNER_INT['NEW']
INNER_INT.NEW_INDEX.duplicated().sum()

0

In [25]:
INNER_INT.set_index(['NEW_INDEX'], inplace=True)
INNER_INT.shape

(475088, 30)

Create an IPEDS Ethnicity column by combining ethnic group and ethnicity and using a dictionary to assign IPEDS values

In [26]:
INNER_INT['ETH'] = np.where(pd.isnull(INNER_INT['Ethnic_Group']), INNER_INT['Ethnicity'], INNER_INT['Ethnic_Group'])

In [27]:
IPEDSETH_DICT = {'Caucasian':'White', 'WHITE':'White','Not specified':'Unknown','Hispanic':'Hispanic/Latino'
                 ,'Black/African American':'Black/African American'
                 ,'Asian/Asian American/Pacific Islander':'Asian','ASIAN':'Asian','BLACK':'Black/African American'
                 ,'NSPEC':'Unknown','Multi-Ethnic':'Two or More Races'
                 ,'Other':'Unknown','SOAMER':'Hispanic/Latino','PUERTOR':'Hispanic/Latino'
                 ,'CENTAMER':'Hispanic/Latino','MEXAMER':'Hispanic/Latino'
                 ,'CUBAN':'Hispanic/Latino', 'HISPA':'Hispanic/Latino'
                 ,'American Indian/Alaskan Native':'American Indian/Alaska Native','NHISP':'Unknown'
                 ,'PACIF':'Native Hawaiian/Other Pacific Islander','AMIND':'American Indian/Alaska Native'
                 ,'SPANISH':'Hispanic/Latino'}

In [28]:
INNER_INT['IPEDS'] = INNER_INT['ETH'].map(IPEDSETH_DICT)

In [29]:
INNER_INT['IPEDS'].value_counts(dropna=False)

White                                     200201
NaN                                       113859
Unknown                                    40952
Black/African American                     39792
Hispanic/Latino                            37675
Asian                                      33513
Two or More Races                           7932
American Indian/Alaska Native                963
Native Hawaiian/Other Pacific Islander       201
Name: IPEDS, dtype: int64

In [30]:
INNER_INT['IPEDS2'] = np.where(pd.isnull(INNER_INT['IPEDS']), "Unknown", INNER_INT['IPEDS'])

In [31]:
INNER_INT['IPEDS2'].value_counts(dropna=False)

White                                     200201
Unknown                                   154811
Black/African American                     39792
Hispanic/Latino                            37675
Asian                                      33513
Two or More Races                           7932
American Indian/Alaska Native                963
Native Hawaiian/Other Pacific Islander       201
Name: IPEDS2, dtype: int64

Create the columns and values for States, Clean the state columns, create state dictionary and combine the State columns

In [32]:
import re

In [33]:
#clean the market segment column, take the 1st 2 letters of the string only
INNER_INT['STATE'] = INNER_INT['Market_Segment'].str.extract('([A-Z]{2})',expand=True)

In [34]:
#check the strings are cleaned
INNER_INT['STATE'].value_counts(dropna=False)

FL     155724
NY      34896
NJ      29364
CA      21954
TX      18844
IL      18133
PA      14307
GA      14236
NaN     12779
MD      12712
MA      12350
NC      11035
OH       9551
CT       8972
VA       8270
TN       7450
AC       6151
MI       5303
AL       4438
LA       4292
MO       3860
CO       3804
IN       3779
SC       3777
MN       3417
KY       2863
AS       2863
EW       2824
WI       2729
AZ       2404
        ...
PR       1465
AR       1395
NH       1307
UT       1302
MS       1262
DE       1226
MM       1216
DC       1091
AF       1054
NV       1053
NE       1051
KS       1038
OR        792
ME        764
IA        755
WV        684
NM        616
EC        581
CN        561
VT        480
ID        405
VI        161
SD        158
MT        150
WY        132
ND        128
AK        109
AP        101
TT         34
AN          5
Name: STATE, Length: 66, dtype: int64

In [35]:
#if the EMPL ID is null pass the STATE value to the new COL otherwise give me the value from "Other_State"
INNER_INT['STATE2'] = np.where(pd.isnull(INNER_INT['EMPLID']), INNER_INT['STATE'], INNER_INT['Other_State'])

In [36]:
#create a reference list to compare the possible state values
import csv
with open('C:/Users/mjc341/Desktop/UMAN 1507 Monthly INQ summary Report/states.csv','r') as f:
    reader= csv.reader(f)
    states = list(reader)
flat_states =[item for sublist in states for item in sublist]
flat_states

['ALABAMA',
 'Alabama',
 'AL',
 'ALASKA',
 'Alaska',
 'AK',
 'ARIZONA',
 'Arizona',
 'AZ',
 'ARKANSAS',
 'Arkansas',
 'AR',
 'CALIFORNIA',
 'California',
 'CA',
 'COLORADO',
 'Colorado',
 'CO',
 'CONNECTICUT',
 'Connecticut',
 'CT',
 'DELAWARE',
 'Delaware',
 'DE',
 'FLORIDA',
 'Florida',
 'FL',
 'GEORGIA',
 'Georgia',
 'GA',
 'HAWAII',
 'Hawaii',
 'HI',
 'IDAHO',
 'Idaho',
 'ID',
 'ILLINOIS',
 'Illinois',
 'IL',
 'INDIANA',
 'Indiana',
 'IN',
 'IOWA',
 'Iowa',
 'IA',
 'KANSAS',
 'Kansas',
 'KS',
 'KENTUCKY',
 'Kentucky',
 'KY',
 'LOUISIANA',
 'Louisiana',
 'LA',
 'MAINE',
 'Maine',
 'ME',
 'MARYLAND',
 'Maryland',
 'MD',
 'MASSACHUSETTS',
 'Massachusetts',
 'MA',
 'MICHIGAN',
 'Michigan',
 'MI',
 'MINNESOTA',
 'Minnesota',
 'MN',
 'MISSISSIPPI',
 'Mississippi',
 'MS',
 'MISSOURI',
 'Missouri',
 'MO',
 'MONTANA',
 'Montana',
 'MT',
 'NEBRASKA',
 'Nebraska',
 'NE',
 'NEVADA',
 'Nevada',
 'NV',
 'NEW HAMPSHIRE',
 'New Hampshire',
 'NH',
 'NEW JERSEY',
 'New Jersey',
 'NJ',
 'NEW MEXICO',
 'New Mexico',
 'NM',
 'NEW YORK',
 'New York',
 'NY',
 'NORTH CAROLINA',
 'North Carolina',
 'NC',
 'NORTH DAKOTA',
 'North Dakota',
 'ND',
 'OHIO',
 'Ohio',
 'OH',
 'OKLAHOMA',
 'Oklahoma',
 'OK',
 'OREGON',
 'Oregon',
 'OR',
 'PENNSYLVANIA',
 'Pennsylvania',
 'PA',
 'RHODE ISLAND',
 'Rhode Island',
 'RI',
 'SOUTH CAROLINA',
 'South Carolina',
 'SC',
 'SOUTH DAKOTA',
 'South Dakota',
 'SD',
 'TENNESSEE',
 'Tennessee',
 'TN',
 'TEXAS',
 'Texas',
 'TX',
 'UTAH',
 'Utah',
 'UT',
 'VERMONT',
 'Vermont',
 'VT',
 'VIRGINIA',
 'Virginia',
 'VA',
 'WASHINGTON',
 'Washington',
 'WA',
 'WEST VIRGINIA',
 'West Virginia',
 'WV',
 'WISCONSIN',
 'Wisconsin',
 'WI',
 'WYOMING',
 'Wyoming',
 'WY',
 'GUAM',
 'Guam',
 'GU',
 'DISTRICT OF COLUMBIA',
 'District of Columbia',
 'DC',
 'FEDERATED STATES OF MICRONESIA',
 'Federated States of Micronesia',
 'FM',
 'MARSHALL ISLANDS',
 'Marshall Islands',
 'MH',
 'NORTHERN MARIANA ISLANDS',
 'Northern Mariana Islands',
 'MP',
 'PALAU',
 'Palau',
 'PW',
 'PUERTO RICO',
 'Puerto Rico',
 'PR',
 'VIRGIN ISLANDS',
 'Virgin Islands',
 'VI']

In [37]:
INNER_INT['STATE2&MAILING'] = np.where(pd.isnull(INNER_INT['Mailing_State']), INNER_INT['STATE2'], INNER_INT['Mailing_State'])

In [38]:
#STATE2 is the cleaned MKTSEGEMNT + OTHER_STATE where EMPLID is null
#STATE3 DEFINES STATE2 as existing in the flat_state file or being NOT in USA
INNER_INT['STATE3'] = np.where(INNER_INT['STATE2'].isin(flat_states),INNER_INT['STATE2'], "Not USA")

In [39]:
INNER_INT['STATE4'] = np.where(INNER_INT['STATE2&MAILING'].isin(flat_states),INNER_INT['STATE2&MAILING'], "Not USA")

In [40]:
INNER_INT['STATE4'].value_counts(dropna=False)

FL                          157736
NY                           33516
Not USA                      30236
NJ                           29625
CA                           21475
TX                           18214
IL                           17762
GA                           13836
PA                           13820
MA                           12333
MD                           12215
NC                           10848
OH                            9305
CT                            9140
VA                            7893
TN                            7433
MI                            5168
AL                            4414
LA                            3971
SC                            3729
IN                            3727
MO                            3718
CO                            3718
MN                            3361
KY                            2792
WI                            2652
AZ                            2375
Florida                       2017
WA                            1887
OK                            1731
                             ...
Kentucky                        18
Arizona                         17
Oklahoma                        16
MP                              16
Nevada                          14
Delaware                        11
New Mexico                      10
Virgin Islands                  10
Oregon                          10
Nebraska                        10
Kansas                           9
West Virginia                    8
Arkansas                         8
Vermont                          8
Hawaii                           7
Iowa                             6
Mississippi                      6
FLORIDA                          5
Idaho                            5
Alaska                           4
Utah                             3
PW                               3
NEW YORK                         2
TEXAS                            1
Wyoming                          1
Montana                          1
OHIO                             1
VIRGIN ISLANDS                   1
North Dakota                     1
Northern Mariana Islands         1
Name: STATE4, Length: 117, dtype: int64

In [41]:
state_dict= {'ALABAMA':'AL','Alabama':'AL','AL':'AL','ALASKA':'AK','Alaska':'AK','AK':'AK','ARIZONA':'AZ','Arizona':'AZ','AZ':'AZ','ARKANSAS':'AR','Arkansas':'AR','AR':'AR','CALIFORNIA':'CA'
,'California':'CA','CA':'CA','COLORADO':'CO','Colorado': 'CO','CO':'CO','CONNECTICUT':'CT'
,'Connecticut':'CT','CT':'CT','DELAWARE':'DE','Delaware':'DE','DE':'DE','FLORIDA':'FL','Florida':'FL'
,'FL':'FL','GEORGIA':'GA','Georgia':'GA','GA':'GA','HAWAII':'HI','Hawaii':'HI','HI':'HI','IDAHO':'ID'
, 'Idaho':'ID','ID':'ID','ILLINOIS':'IL','Illinois':'IL','IL':'IL','INDIANA':'IN','Indiana':'IN','IN':'IN'
,'IOWA':'IA','Iowa':'IA','IA':'IA','KANSAS':'KS','Kansas':'KS','KS':'KS','KENTUCKY':'KY','Kentucky':'KY'
,'KY':'KY','LOUISIANA':'LA','Louisiana':'LA','LA':'LA','MAINE':'ME','Maine':'ME','ME':'ME'
,'MARYLAND':'MD','Maryland':'MD','MD':'MD','MASSACHUSETTS':'MA','Massachusetts':'MA','MA':'MA'
,'MICHIGAN':'MI','Michigan':'MI','MI':'MI','MINNESOTA':'MN','Minnesota':'MN','MN':'MN','MISSISSIPPI':'MS'
,'Mississippi':'MS','MS':'MS','MISSOURI':'MO','Missouri':'MO','MO':'MO','MONTANA':'MT','Montana':'MT'
,'MT':'MT','NEBRASKA':'NE','Nebraska':'NE','NE':'NE','NEVADA':'NV','Nevada':'NV','NV':'NV'
,'NEW HAMPSHIRE':'NH','New Hampshire':'NH','NH':'NH','NEW JERSEY':'NJ','New Jersey':'NJ','NJ':'NJ'
,'NEW MEXICO':'NM','New Mexico':'NM','NM':'NM','NEW YORK':'NY','New York':'NY', 'NY':'NY'
,'NORTH CAROLINA':'NC','North Carolina':'NC','NC':'NC','NORTH DAKOTA':'ND','North Dakota':'ND','ND':'ND'
,'OHIO':'OH','Ohio':'OH','OH':'OH','OKLAHOMA':'OK','Oklahoma':'OK','OK':'OK','OREGON':'OR','Oregon':'OR'
,'OR':'OR','PENNSYLVANIA':'PA','Pennsylvania':'PA','PA':'PA','RHODE ISLAND':'RI'
,'Rhode Island':'RI','RI':'RI','SOUTH CAROLINA':'SC','South Carolina':'SC','SC':'SC','SOUTH DAKOTA':'SD'
,'South Dakota':'SD','SD':'SD','TENNESSEE':'TN','Tennessee':'TN','TN':'TN','TEXAS':'TX','Texas':'TX'
,'TX':'TX','UTAH':'UT','Utah':'UT','UT':'UT','VERMONT':'VT','Vermont':'VT','VT':'VT','VIRGINIA':'VA'
,'Virginia':'VA','VA':'VA','WASHINGTON':'WA','Washington':'WA','WA':'WA','WEST VIRGINIA':'WV'
,'West Virginia':'WV','WV':'WV','WISCONSIN':'WI','Wisconsin':'WI','WI':'WI','WYOMING':'WY','Wyoming':'WY'
,'WY':'WY','GUAM':'GU','Guam':'GU','GU':'GU','DISTRICT OF COLUMBIA':'DC','District of Columbia':'DC'
,'DC':'DC','FEDERATED STATES OF MICRONESIA':'FM','Federated States of Micronesia':'FM','FM':'FM'
,'MARSHALL ISLANDS':'MH','Marshall Islands':'MH','MH':'MH','NORTHERN MARIANA ISLANDS':'MP'
,'Northern Mariana Islands':'MP','MP':'MP', 'PALAU':'PW','Palau':'PW','PW':'PW','PUERTO RICO':'PR'
,'Puerto Rico':'PR','PR':'PR','VIRGIN ISLANDS':'VI','Virgin Islands':'VI','VI':'VI'}

In [42]:
INNER_INT['STATE5'] = INNER_INT['STATE4'].map(state_dict)

In [43]:
INNER_INT['STATE5'].value_counts(dropna=False)

FL     159758
NY      34128
NaN     30236
NJ      30195
CA      21872
TX      18396
IL      18030
PA      14052
GA      14027
MA      12675
MD      12410
NC      10988
OH       9390
CT       9291
VA       8078
TN       7461
MI       5240
AL       4439
LA       4005
MO       3777
CO       3771
SC       3767
IN       3765
MN       3407
KY       2810
WI       2688
AZ       2392
WA       1941
OK       1747
RI       1573
HI       1570
PR       1482
AR       1383
NH       1319
DE       1273
UT       1265
MS       1257
NV       1063
KS       1010
NE        922
DC        917
OR        819
ME        776
IA        700
NM        600
WV        584
VT        497
ID        405
MT        156
VI        148
SD        146
ND        132
AK        122
WY        121
FM         35
MH         33
GU         24
MP         17
PW          3
Name: STATE5, dtype: int64

In [44]:
INNER_INT['STATE5'].value_counts(dropna=False).sum()

475088

In [45]:
INNER_INT.columns

Index(['Contact_ID', 'Int_Name', 'Admit_Type', 'EMPLID', 'Ethnic_Group',
       'Ethnicity', 'Gender', 'Term', 'Lead_Source', 'Create_Date',
       'Mailing_Street', 'Mailing_City', 'Mailing_State', 'Mailing_Postal',
       'Mailing_Country', 'Other_City', 'Other_State', 'Other_Postal',
       'Mailing_Country', 'Market_Segment_Code', 'Market_Segment', 'OppName',
       'CONTerm', 'Record_Type', 'Inquiry', 'Inquiry_Date', 'Opp_ID', 'EMPL',
       'App_Number', 'NEW', 'ETH', 'IPEDS', 'IPEDS2', 'STATE', 'STATE2',
       'STATE2&MAILING', 'STATE3', 'STATE4', 'STATE5'],
      dtype='object')

Return to previous code string and create all of the date variables

In [46]:
# Create a datetime variable from Create_Date this operation takes up to 3 min
#INT['Create_Date']= pd.to_datetime(INT.Create_Date)
INNER_INT['Create_Date']= pd.to_datetime(INNER_INT.Create_Date)

In [47]:
#INT.info()

In [48]:
#find earliest create date
#INT['Create_Date'].min()
INNER_INT['Create_Date'].min()

Timestamp('2001-08-06 00:00:00')

Here we will insert the lambda function to extract the YEAR and MONTH from the new datetime type so we can filter on YEAR and groupby MONTH also add M col that can be dictionaried to Names of MONTHS instead of numbers. Question can we format the month names at the conversion?

In [49]:
#INT.loc[:,'YEAR'] =INT['Create_Date'].apply(lambda x: "%d" % (x.year))
INNER_INT.loc[:,'YEAR'] =INNER_INT['Create_Date'].apply(lambda x: "%d" % (x.year))

In [50]:
#INT.loc[:,'MONTH'] = INT['Create_Date'].apply(lambda x: "%d" % (x.month))
INNER_INT.loc[:,'MONTH'] = INNER_INT['Create_Date'].apply(lambda x: "%d" % (x.month))

In [51]:
INNER_INT.head(1)

,Contact_ID,Int_Name,Admit_Type,EMPLID,Ethnic_Group,Ethnicity,Gender,Term,Lead_Source,Create_Date,...,IPEDS,IPEDS2,STATE,STATE2,STATE2&MAILING,STATE3,STATE4,STATE5,YEAR,MONTH
NEW_INDEX,,,,,,,,,,,,,,,,,,,,,
0031500001d4Si8AAE0,0031500001d4Si8AAE,20160320-0100599,New Student,NaN,NaN,NaN,Female,Fall 2015,Purchased List,2013-01-04,...,NaN,Unknown,NaN,NaN,FL,Not USA,FL,FL,2013,1

In [52]:
# filter on term for 2017,2018,2019,2020
#TERM2017 = INT.loc[(INT.Term == 'Fall 2017')]
#TERM2018 = INT.loc[(INT.Term == 'Fall 2018')]
#TERM2019 = INT.loc[(INT.Term == 'Fall 2019')]
#TERM2020 = INT.loc[(INT.Term == 'Fall 2020')]
TERM2017 = INNER_INT.loc[(INNER_INT.CONTerm == 'Fall 2017')]
TERM2018 = INNER_INT.loc[(INNER_INT.CONTerm == 'Fall 2018')]
TERM2019 = INNER_INT.loc[(INNER_INT.CONTerm == 'Fall 2019')]
TERM2020 = INNER_INT.loc[(INNER_INT.CONTerm == 'Fall 2020')]

In [53]:
len(TERM2017)

189369

In [54]:
len(TERM2018)

145379

In [55]:
len(TERM2019)

108205

In [56]:
len(TERM2020)

32135

In [57]:
#filter on YEAR for  2016,2017,2018,2019
#INQ2017 df is inquiries made in 2016 for 2017 TERM
INQ2017 = TERM2017[TERM2017['YEAR'] == '2016']
INQ2018 = TERM2018[TERM2018['YEAR'] == '2017']
INQ2019 = TERM2019[TERM2019['YEAR'] == '2018']
INQ2020 = TERM2020[TERM2020['YEAR'] == '2018']
INQ2017year2 = TERM2017[TERM2017['YEAR'] == '2017']
INQ2018year2 = TERM2018[TERM2018['YEAR'] == '2017']
INQ2019year2 = TERM2019[TERM2019['YEAR'] == '2018']

In [58]:
len(INQ2017)

102129

In [59]:
len(INQ2018)

86647

In [60]:
len(INQ2019)

79353

In [61]:
len(INQ2020)

25589

In [62]:
#show head of INQ2017 same for 2017,2018,2019
INQ2017.head(1)

,Contact_ID,Int_Name,Admit_Type,EMPLID,Ethnic_Group,Ethnicity,Gender,Term,Lead_Source,Create_Date,...,IPEDS,IPEDS2,STATE,STATE2,STATE2&MAILING,STATE3,STATE4,STATE5,YEAR,MONTH
NEW_INDEX,,,,,,,,,,,,,,,,,,,,,
0031500001d4SiCAAU8,0031500001d4SiCAAU,20160320-0910984,New Student,50442768.0,NaN,Black/African American,Female,Fall 2017,Web Form,2016-01-12,...,Black/African American,Black/African American,EW,Florida,FL,Florida,FL,FL,2016,1

In [63]:
INQ2017.columns

Index(['Contact_ID', 'Int_Name', 'Admit_Type', 'EMPLID', 'Ethnic_Group',
       'Ethnicity', 'Gender', 'Term', 'Lead_Source', 'Create_Date',
       'Mailing_Street', 'Mailing_City', 'Mailing_State', 'Mailing_Postal',
       'Mailing_Country', 'Other_City', 'Other_State', 'Other_Postal',
       'Mailing_Country', 'Market_Segment_Code', 'Market_Segment', 'OppName',
       'CONTerm', 'Record_Type', 'Inquiry', 'Inquiry_Date', 'Opp_ID', 'EMPL',
       'App_Number', 'NEW', 'ETH', 'IPEDS', 'IPEDS2', 'STATE', 'STATE2',
       'STATE2&MAILING', 'STATE3', 'STATE4', 'STATE5', 'YEAR', 'MONTH'],
      dtype='object')

In [64]:
#confirm that filtered data is a datafram
type(INQ2017)

pandas.core.frame.DataFrame

In [65]:
#pd.show_versions()

In [66]:
#get count by month of each term
INQ2017.Create_Date.dt.month.value_counts().sort_index()

1      3968
2      5121
3      1772
4      1482
5      2646
6     12583
7     13035
8      2484
9      7802
10    18427
11    17765
12    15044
Name: Create_Date, dtype: int64

In [67]:
INQ2018.Create_Date.dt.month.value_counts().sort_index()

1      1875
2      3970
3      3628
4      3577
5     10628
6      7075
7      3833
8      5013
9      6023
10    20579
11    15508
12     4938
Name: Create_Date, dtype: int64

In [68]:
INQ2019.Create_Date.dt.month.value_counts().sort_index()

1      2406
2      2761
3     10246
4     11952
5      7030
6     11009
7      6822
8      2596
9     16169
10     8362
Name: Create_Date, dtype: int64

In [69]:
#this creates a list for 2018 dates but will eventually have to be changed to 2019 dates
INQ2020.Create_Date.dt.month.value_counts().sort_index()

1       573
2       651
3     12060
4      2048
5      1353
6       687
7      3361
8       553
9      2608
10     1695
Name: Create_Date, dtype: int64

In [70]:
#create a timestamp to get values from the FAll 2018 term that are prior to Jan 1 2017
#also created a timestamp for february and august values of the subsequent year of each opp term
#a current timestamp was also created as well as the Y-o-Y time stamps (12-15).
tsprior = pd.Timestamp('1/1/2016')
tsprior2 = pd.Timestamp('1/1/2017')
tsprior3 = pd.Timestamp('1/1/2018')
tsprior4 = pd.Timestamp('1/1/2019')
tsprior5 = pd.Timestamp('2/1/2017')
tsprior6 = pd.Timestamp('2/1/2018')
tsprior7 = pd.Timestamp('2/1/2019')
tsprior8 = pd.Timestamp('8/1/2017')
tsprior9 = pd.Timestamp('8/1/2018')
tsprior10 = pd.Timestamp('9/1/2019')
tsprior11 = pd.Timestamp('9/1/2018')
tsprior12 = pd.Timestamp('9/1/2017')
tsprior13 = pd.Timestamp('9/1/2016')

In [71]:
tsprior

Timestamp('2016-01-01 00:00:00')

In [72]:
B4JAN16 = TERM2017.loc[TERM2017.Create_Date < tsprior,:]
B4JAN17 = TERM2018.loc[TERM2018.Create_Date < tsprior2,:]
B4JAN18 = TERM2019.loc[TERM2019.Create_Date < tsprior3,:]
B4JAN19 = TERM2020.loc[TERM2020.Create_Date < tsprior3,:]
B4FEB17 = TERM2017.loc[TERM2017.Create_Date < tsprior5,:]
B4FEB18 = TERM2018.loc[TERM2018.Create_Date < tsprior6,:]
B4FEB19 = TERM2019.loc[TERM2019.Create_Date < tsprior7,:]
B4FEB20 = TERM2020.loc[TERM2020.Create_Date < tsprior7,:]
B4AUG17 = TERM2017.loc[TERM2017.Create_Date < tsprior8,:]
B4AUG18 = TERM2018.loc[TERM2018.Create_Date < tsprior9,:]
TOTAL2017 = TERM2017.loc[TERM2017.Create_Date < tsprior10,:]
TOTAL2018 = TERM2018.loc[TERM2018.Create_Date < tsprior10,:]
TOTAL2019 = TERM2019.loc[TERM2019.Create_Date < tsprior10,:]
TOTAL2020 = TERM2020.loc[TERM2020.Create_Date < tsprior10,:]
YoY2017 = TERM2017.loc[TERM2017.Create_Date < tsprior13,:]
YoY2018 = TERM2018.loc[TERM2018.Create_Date < tsprior12,:]
YoY2019 = TERM2019.loc[TERM2019.Create_Date < tsprior11,:]

In [73]:
len(B4JAN16)

63460

In [74]:
len(B4JAN17)

37499

In [75]:
len(B4JAN18)

28852

In [76]:
len(B4JAN19)

6546

In [77]:
#test the counts
B4JAN16['Contact_ID'].value_counts().sum()
#B4JAN17['Contact_ID'].value_counts().sum()
#B4JAN18['Contact_ID'].value_counts().sum()
#B4JAN19['Contact_ID'].value_counts().sum()
#B4FEB17['Contact_ID'].value_counts().sum()
#B4FEB18['Contact_ID'].value_counts().sum()
#B4FEB19['Contact_ID'].value_counts().sum()
#B4FEB20['Contact_ID'].value_counts().sum()
#B4AUG17['Contact_ID'].value_counts().sum()
#B4AUG18['Contact_ID'].value_counts().sum()
#TOTAL2017['Contact_ID'].value_counts().sum()
#TOTAL2018['Contact_ID'].value_counts().sum()
#TOTAL2019['Contact_ID'].value_counts().sum()
#TOTAL2020['Contact_ID'].value_counts().sum()

63460

In [78]:
#B4JAN19['Contact_ID'].value_counts().sum()

In [79]:
R17 = INQ2017.Create_Date.dt.month.value_counts().sort_index()
R18 = INQ2018.Create_Date.dt.month.value_counts().sort_index()
R19 = INQ2019.Create_Date.dt.month.value_counts().sort_index()
R20 = INQ2020.Create_Date.dt.month.value_counts().sort_index()

In [80]:
R17df = pd.DataFrame([R17]).T
R18df = pd.DataFrame([R18]).T
R19df = pd.DataFrame([R19]).T
R20df = pd.DataFrame([R20]).T

In [81]:
#R16df.head()

In [82]:
a =R17df.rename({'Create_Date': 'Count-2016'}, axis = 'columns')
#R16df.rename({'Create_Date': 'Count-2016'}, axis = 'columns')

In [83]:
b = R18df.rename({'Create_Date': 'Count-2017'}, axis = 'columns')
#R17df.rename({'Create_Date': 'Count-2017'}, axis = 'columns')

In [84]:
#R18df.rename({'Create_Date': 'Count-2018'}, axis = 'columns')
c = R19df.rename({'Create_Date': 'Count-2018'}, axis = 'columns')

In [85]:
d = R20df.rename({'Create_Date': 'Count-2018'}, axis = 'columns')

In [86]:
j = pd.concat([a, b], axis=1, join_axes=[a.index])

In [87]:
#j.head(1)

In [88]:
k = pd.concat([j, c], axis=1, join_axes=[a.index])

In [89]:
k2 = pd.concat([k, d], axis=1, join_axes=[a.index])

In [90]:
k2.head()

   Count-2016  Count-2017  Count-2018  Count-2018
1        3968        1875      2406.0       573.0
2        5121        3970      2761.0       651.0
3        1772        3628     10246.0     12060.0
4        1482        3577     11952.0      2048.0
5        2646       10628      7030.0      1353.0

In [91]:
#k.head()

In [92]:
type(k2)

pandas.core.frame.DataFrame

In [93]:
k2.dtypes

Count-2016      int64
Count-2017      int64
Count-2018    float64
Count-2018    float64
dtype: object

In [94]:
k =  k2.replace(np.nan,0)

In [95]:
k['Count-2018'] = k['Count-2018'].astype(int)
k

    Count-2016  Count-2017  Count-2018  Count-2018
1         3968        1875        2406         573
2         5121        3970        2761         651
3         1772        3628       10246       12060
4         1482        3577       11952        2048
5         2646       10628        7030        1353
6        12583        7075       11009         687
7        13035        3833        6822        3361
8         2484        5013        2596         553
9         7802        6023       16169        2608
10       18427       20579        8362        1695
11       17765       15508           0           0
12       15044        4938           0           0

In [96]:
#k.dtypes

In [97]:
k.index

Int64Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12], dtype='int64')

In [98]:
# create  a dictionary to map the month values
dict = {1:'JAN',2:'FEB',3:'MAR',4:'APR',5:'MAY',6:'JUN',7:'JUL',8:'AUG',9:'SEP',10:'OCT',11:'NOV',12:'DEC'}

In [99]:
#map the dictionary to the new col on index
k ['MONTH'] = k.index.map(dict)

In [100]:
k

    Count-2016  Count-2017  Count-2018  Count-2018 MONTH
1         3968        1875        2406         573   JAN
2         5121        3970        2761         651   FEB
3         1772        3628       10246       12060   MAR
4         1482        3577       11952        2048   APR
5         2646       10628        7030        1353   MAY
6        12583        7075       11009         687   JUN
7        13035        3833        6822        3361   JUL
8         2484        5013        2596         553   AUG
9         7802        6023       16169        2608   SEP
10       18427       20579        8362        1695   OCT
11       17765       15508           0           0   NOV
12       15044        4938           0           0   DEC

In [101]:
#change the name of the df and rearrange the cols
INQbyMONTH = k[['MONTH','Count-2016','Count-2017','Count-2018']]

In [102]:
#this is the result
INQbyMONTH

   MONTH  Count-2016  Count-2017  Count-2018  Count-2018
1    JAN        3968        1875        2406         573
2    FEB        5121        3970        2761         651
3    MAR        1772        3628       10246       12060
4    APR        1482        3577       11952        2048
5    MAY        2646       10628        7030        1353
6    JUN       12583        7075       11009         687
7    JUL       13035        3833        6822        3361
8    AUG        2484        5013        2596         553
9    SEP        7802        6023       16169        2608
10   OCT       18427       20579        8362        1695
11   NOV       17765       15508           0           0
12   DEC       15044        4938           0           0

In [103]:
#it is a df
type(INQbyMONTH)

pandas.core.frame.DataFrame

In [104]:
#before January values
a = B4JAN16['Contact_ID'].value_counts().sum()
b = B4JAN17['Contact_ID'].value_counts().sum()
c = B4JAN18['Contact_ID'].value_counts().sum()
d = B4JAN19['Contact_ID'].value_counts().sum()

In [105]:
PRIOR = pd.DataFrame({'Prior to Jan 2016': a , 'Prior to Jan 2017': b , 'Prior to Jan 2018': c, 'Prior to Jan 2018.2': d},index = [0])

In [106]:
PRIOR

,Prior to Jan 2016,Prior to Jan 2017,Prior to Jan 2018,Prior to Jan 2018.2
0,63460,37499,28852,6546

In [107]:
#before February values
e = B4FEB17['Contact_ID'].value_counts().sum()
f = B4FEB18['Contact_ID'].value_counts().sum()

In [108]:
PRIOR2 = pd.DataFrame({'Prior to Feb 2017': e , 'Prior to Feb 2018': f },index = [0])

In [109]:
PRIOR2

   Prior to Feb 2017  Prior to Feb 2018
0             174373             133036

In [110]:
#before August values
g = B4AUG17['Contact_ID'].value_counts().sum()
h = B4AUG18['Contact_ID'].value_counts().sum()

In [111]:
PRIOR3 = pd.DataFrame({'Prior to Aug 2017': g , 'Prior to Aug 2018': h },index = [0])

In [112]:
PRIOR3

   Prior to Aug 2017  Prior to Aug 2018
0             187528             145017

In [113]:
#current values
i = TOTAL2017['Contact_ID'].value_counts().sum()
j = TOTAL2018['Contact_ID'].value_counts().sum()
k = TOTAL2019['Contact_ID'].value_counts().sum()
l = TOTAL2020['Contact_ID'].value_counts().sum()

In [114]:
TOTAL4 = pd.DataFrame({'Total 2017': i , 'Total 2018': j, 'Total 2019': k, 'Total 2020': l},index = [0])

In [115]:
TOTAL4

   Total 2017  Total 2018  Total 2019  Total 2020
0      189369      145379      108205       32135

In [116]:
#create a df for the y-o-y comparison of 2017, 2018, and 2019. #redundant???
#tspriorFEB17 = pd.Timestamp('2/1/2017')
#tspriorFEB18 = pd.Timestamp ('2/1/2018')
#tspriorFEB19 = pd.Timestamp('2/1/2019')
#tspriorAUG17 = pd.Timestamp('8/1/2017')
#tspriorAUG18 = pd.Timestamp ('8/1/2018')
#tspriorAUG19 = pd.Timestamp('8/1/2019')
#tsJUN312017 = pd.Timestamp('6/30/2017')
#tsJUN312018 = pd.Timestamp('6/30/2018')
#tsJUN312019 = pd.Timestamp('6/30/2019')

In [117]:
#LeadSource Counts for AdmitTerm 2017 that occured in 2016
LEAD17 = YoY2017.pivot_table(index=['Lead_Source'],values =['Contact_ID'],aggfunc =len)
LEAD17.rename(index= str, columns={'Contact_ID':'2017'},inplace =True)
LEAD17

                                   2017
Lead_Source
Admission Conversion                 31
College Fair                      10624
College Visit                        13
Education Fair                       10
Email                               212
Event Registration                 9744
Financial Aid                       130
Group Tour                            4
High School Visit                  4265
Initiated Application               807
International Travel                258
Lead Card                           354
Legacy Admission Alumni Form          5
Legacy Admission Student Form         4
Letter of Recommendation              1
Office Visit                        161
Other                              3289
Phone                                32
Purchased List                    49952
Resume                                1
Royal Short Mailing List Form        47
Submitted Test Score              17184
Submitted Transcript                  3
UGrad Campus Visit Check-in Form    574
Web Form                           8828

In [118]:
#LeadSource Counts for AdmitTerm 2018 that occured in 2017
LEAD18 = YoY2018.pivot_table(index=['Lead_Source'],values =['Contact_ID'],aggfunc =len)
LEAD18.rename(index= str, columns={'Contact_ID':'2018'},inplace =True)
LEAD18

                                   2018
Lead_Source
Admission Conversion                 21
College Fair                      10379
College Visit                        27
Education Fair                        8
Email                                83
Event Registration                10535
Financial Aid                         6
Group Tour                          405
High School Visit                  3232
Initiated Application               237
International Travel                 40
Lead Card                           242
Legacy Admission Alumni Form          1
Office Visit                        181
Other                               422
Phone                                 4
Purchased List                    29903
Royal Short Mailing List Form         4
Search Responder                    317
Submitted Test Score              12422
Submitted Transcript                  1
UGrad Campus Visit Check-in Form     93
Virtual Tour                        405
Web Form                           8126

In [119]:
#LeadSource Counts for AdmitTerm 2019 that occured in 2018
LEAD19 = YoY2019.pivot_table(index=['Lead_Source'],values =['Contact_ID'],aggfunc =len)
LEAD19.rename(index= str, columns={'Contact_ID':'2019'},inplace =True)
LEAD19

                                   2019
Lead_Source
Admission Conversion                  4
College Fair                      10116
College Visit                        12
Education Fair                       12
Email                                31
Event Registration                12523
Financial Aid                         5
Group Tour                          476
High School Visit                  2889
Initiated Application                32
International Travel                  1
Lead Card                           199
Office Visit                        363
Other                                13
Phone                                 2
Professional Association              1
Professional Conference               1
Purchased List                    22093
Search Responder                   8413
Submitted Test Score              16916
UGrad Campus Visit Check-in Form     15
Virtual                             104
Virtual Tour                       1101
Web Form                           8352

In [120]:
LEAD1 = pd.concat([LEAD17, LEAD18], axis=1, join_axes=[LEAD18.index])
LEAD1

                                     2017   2018
Lead_Source
Admission Conversion                 31.0     21
College Fair                      10624.0  10379
College Visit                        13.0     27
Education Fair                       10.0      8
Email                               212.0     83
Event Registration                 9744.0  10535
Financial Aid                       130.0      6
Group Tour                            4.0    405
High School Visit                  4265.0   3232
Initiated Application               807.0    237
International Travel                258.0     40
Lead Card                           354.0    242
Legacy Admission Alumni Form          5.0      1
Office Visit                        161.0    181
Other                              3289.0    422
Phone                                32.0      4
Purchased List                    49952.0  29903
Royal Short Mailing List Form        47.0      4
Search Responder                      NaN    317
Submitted Test Score              17184.0  12422
Submitted Transcript                  3.0      1
UGrad Campus Visit Check-in Form    574.0     93
Virtual Tour                          NaN    405
Web Form                           8828.0   8126

In [121]:
Lead2 = pd.concat([LEAD1, LEAD19], axis=1, join_axes=[LEAD18.index])
Lead2

                                     2017   2018     2019
Lead_Source
Admission Conversion                 31.0     21      4.0
College Fair                      10624.0  10379  10116.0
College Visit                        13.0     27     12.0
Education Fair                       10.0      8     12.0
Email                               212.0     83     31.0
Event Registration                 9744.0  10535  12523.0
Financial Aid                       130.0      6      5.0
Group Tour                            4.0    405    476.0
High School Visit                  4265.0   3232   2889.0
Initiated Application               807.0    237     32.0
International Travel                258.0     40      1.0
Lead Card                           354.0    242    199.0
Legacy Admission Alumni Form          5.0      1      NaN
Office Visit                        161.0    181    363.0
Other                              3289.0    422     13.0
Phone                                32.0      4      2.0
Purchased List                    49952.0  29903  22093.0
Royal Short Mailing List Form        47.0      4      NaN
Search Responder                      NaN    317   8413.0
Submitted Test Score              17184.0  12422  16916.0
Submitted Transcript                  3.0      1      NaN
UGrad Campus Visit Check-in Form    574.0     93     15.0
Virtual Tour                          NaN    405   1101.0
Web Form                           8828.0   8126   8352.0

In [122]:
LEAD = Lead2.fillna(0)
LEAD['2018'] = LEAD['2018'].astype(int)
LEAD['2019'] = LEAD['2019'].astype(int)
LEAD

                                     2017   2018   2019
Lead_Source
Admission Conversion                 31.0     21      4
College Fair                      10624.0  10379  10116
College Visit                        13.0     27     12
Education Fair                       10.0      8     12
Email                               212.0     83     31
Event Registration                 9744.0  10535  12523
Financial Aid                       130.0      6      5
Group Tour                            4.0    405    476
High School Visit                  4265.0   3232   2889
Initiated Application               807.0    237     32
International Travel                258.0     40      1
Lead Card                           354.0    242    199
Legacy Admission Alumni Form          5.0      1      0
Office Visit                        161.0    181    363
Other                              3289.0    422     13
Phone                                32.0      4      2
Purchased List                    49952.0  29903  22093
Royal Short Mailing List Form        47.0      4      0
Search Responder                      0.0    317   8413
Submitted Test Score              17184.0  12422  16916
Submitted Transcript                  3.0      1      0
UGrad Campus Visit Check-in Form    574.0     93     15
Virtual Tour                          0.0    405   1101
Web Form                           8828.0   8126   8352

In [123]:
#Count all Inq for the 2017 Admit term that occured before August of 2017  #Redundant???
#B4AUG17 = TERM2017.loc[TERM2017.Create_Date <= tspriorAUG17,:]
#len(B4AUG17)

In [124]:
#Count all Inq for the 2018 Admit term that occured before August of 2018 #Redundant???
#B4AUG18 = TERM2018.loc[TERM2018.Create_Date <= tspriorAUG18,:]
#len(B4AUG18)

In [125]:
# create the path where the results willbe sent
path_final = r'C:/Users/mjc341/Desktop/EMSA-GIT/COLAB'
#path_final = r'C:/Users/sxh706/Desktop'

In [126]:
#path_final

In [127]:
#Ethnicity Counts for AdmitTerm 2017 that occured in 2016
ETH17 = YoY2017.pivot_table(index=['IPEDS2'],values =['Contact_ID'],aggfunc =len)
ETH17.rename(index= str, columns={'Contact_ID':'2017'},inplace =True)
ETH17

                                         2017
IPEDS2
American Indian/Alaska Native             249
Asian                                    6895
Black/African American                  11660
Hispanic/Latino                          9063
Native Hawaiian/Other Pacific Islander     27
Two or More Races                        1744
Unknown                                 29871
White                                   47042

In [128]:
#ETH Counts for AdmitTerm 2018 that occured in 2017
ETH18 = YoY2018.pivot_table(index=['IPEDS2'],values =['Contact_ID'],aggfunc =len)
ETH18.rename(index= str, columns={'Contact_ID':'2018'},inplace =True)
ETH18

                                         2018
IPEDS2
American Indian/Alaska Native             166
Asian                                    4570
Black/African American                   6448
Hispanic/Latino                          6246
Native Hawaiian/Other Pacific Islander     31
Two or More Races                        1477
Unknown                                 29030
White                                   29130

In [129]:
#Ethnicity Counts for AdmitTerm 2019 that occured in 2018
ETH19 = YoY2019.pivot_table(index=['IPEDS2'],values =['Contact_ID'],aggfunc =len)
ETH19.rename(index= str, columns={'Contact_ID':'2019'},inplace =True)
ETH19

                                         2019
IPEDS2
American Indian/Alaska Native             232
Asian                                    3704
Black/African American                   6073
Hispanic/Latino                          7318
Native Hawaiian/Other Pacific Islander     10
Two or More Races                        2150
Unknown                                 36726
White                                   27461

In [130]:
ETH1 = pd.concat([ETH17, ETH18], axis=1, join_axes=[ETH18.index])
ETH2 = pd.concat([ETH1, ETH19], axis=1, join_axes=[ETH18.index])
ETH2

                                         2017   2018   2019
IPEDS2
American Indian/Alaska Native             249    166    232
Asian                                    6895   4570   3704
Black/African American                  11660   6448   6073
Hispanic/Latino                          9063   6246   7318
Native Hawaiian/Other Pacific Islander     27     31     10
Two or More Races                        1744   1477   2150
Unknown                                 29871  29030  36726
White                                   47042  29130  27461

In [131]:
ETH2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, American Indian/Alaska Native to White
Data columns (total 3 columns):
2017    8 non-null int64
2018    8 non-null int64
2019    8 non-null int64
dtypes: int64(3)
memory usage: 256.0+ bytes

In [132]:
#State Counts for AdmitTerm 2017 that occured in 2016
STATE17 = YoY2017.pivot_table(index=['STATE5'],values =['Contact_ID'],aggfunc =len)
STATE17.rename(index= str, columns={'Contact_ID':'2017'},inplace =True)
STATE18 = YoY2018.pivot_table(index=['STATE5'],values =['Contact_ID'],aggfunc =len)
STATE18.rename(index= str, columns={'Contact_ID':'2018'},inplace =True)
STATE19 = YoY2019.pivot_table(index=['STATE5'],values =['Contact_ID'],aggfunc =len)
STATE19.rename(index= str, columns={'Contact_ID':'2019'},inplace =True)

In [133]:
ST1 = pd.concat([STATE17, STATE18], axis=1, join_axes=[STATE18.index])
ST2 = pd.concat([ST1, STATE19], axis=1, join_axes=[STATE18.index])
ST2

         2017   2018   2019
STATE5
AK         42     20     21
AL       1939    691    908
AR        466    256    294
AZ        796    453    442
CA       4706   3265   3535
CO        869    713    820
CT       1289   1173   2140
DC        138    134    153
DE        300    243    285
FL      33223  26844  27617
FM          2     12      3
GA       3567   2549   2570
GU          1      2      7
HI        386    296    361
IA        256    116    133
ID        142     38     97
IL       3973   3249   3577
IN       1371    540    624
KS        332    192    185
KY       1187    460    447
LA       1350    744    802
MA       2120   1671   2503
MD       2627   1970   2488
ME        136     85    122
MH          2     12      6
MI       1331    904   1215
MN       1348    653    584
MO        990    621    713
MS        307    250    341
MT         63     22     31
NC       5230   1642   1635
ND         36     26     38
NE        240    168    245
NH        251    192    278
NJ       4954   4371   5418
NM        199     52     97
NV        335    145    224
NY       5268   4756   5668
OH       2445   1939   2108
OK        771    229    315
OR        284    119    121
PA       3269   2469   2719
PR        155    199    132
RI        246    239    304
SC       1294    746    781
SD         45     23     27
TN       3182   1246   1002
TX       5296   3638   3591
UT        756    164    143
VA       2030   1334   1427
VI         37     13      8
VT        103     73     58
WA        678    296    322
WI        729    451    614
WV        224     66    144
WY         34     26     14

In [134]:
writer = pd.ExcelWriter(path_final + '/' + 'SalesForceByMonthSept' + '.xlsx')
INQbyMONTH.to_excel(writer,'Results')
PRIOR.to_excel(writer, 'PRIOR')
PRIOR2.to_excel(writer, 'PRIOR2')
PRIOR3.to_excel(writer, 'PRIOR3')
TOTAL4.to_excel(writer, 'TOTAL4')
LEAD.to_excel(writer,'LEAD')
ETH2.to_excel(writer,'ETH2')
ST2.to_excel(writer,'ST2')

workbook = writer.book
worksheet = writer.sheets['Results'] 
worksheet2 = writer.sheets ['PRIOR']
worksheet3 = writer.sheets ['PRIOR2']
worksheet4 = writer.sheets ['PRIOR3']
worksheet5 = writer.sheets ['TOTAL4']
worksheet6 = writer.sheets ['LEAD']
worksheet7 = writer.sheets ['ETH2']
worksheet8 = writer.sheets['ST2']

format1 = workbook.add_format({'num_format': '#,##', 'bold': True, 'border': '1'})
format2 = workbook.add_format({'num_format': '##,###', 'border': '1','bg_color':'#FFC7CE'})
format3 = workbook.add_format({'border': '1','bg_color':'#DAF7A6'})
format4 = workbook.add_format({'border': '1','bg_color':'#DAF7A6'})
#added bkground color so we can show different years

# Note: It isn't possible to format any cells that already have a format such
# as the index or headers or any cells that contain dates or datetimes.

worksheet.set_column('A:A', 10)
worksheet.set_column('B:E', 12)
worksheet.set_row(1, None, format2)
worksheet.set_row(2, None, format2)
worksheet.set_row(3, None, format2)
worksheet.set_row(4, None, format2)
worksheet.set_row(5, None, format2)
worksheet.set_row(6, None, format2)
worksheet.set_row(7, None, format2)
worksheet.set_row(8, None, format2)
worksheet.set_row(9, None, format2)
worksheet.set_row(10, None, format2)
worksheet.set_row(11, None, format2)
worksheet.set_row(12, None, format2)

worksheet2.set_column('A:A', 10)
worksheet2.set_column('B:E', 18)
worksheet2.set_row(1, None, format3)
worksheet2.set_row(2, None, format4)

worksheet3.set_column('A:A', 10)
worksheet3.set_column('B:C', 18)
worksheet3.set_row(1, None, format3)
worksheet3.set_row(2, None, format4)

worksheet4.set_column('A:A', 10)
worksheet4.set_column('B:C', 18)
worksheet4.set_row(1, None, format3)
worksheet4.set_row(2, None, format4)

worksheet5.set_column('A:A', 10)
worksheet5.set_column('B:E', 18)
worksheet5.set_row(1, None, format3)
worksheet5.set_row(2, None, format4)

worksheet6.set_column('A:A', 10)
worksheet6.set_column('B:E', 18)
worksheet6.set_row(1, None, format3)
worksheet6.set_row(2, None, format4)
worksheet6.set_row(3, None, format4)
worksheet6.set_row(4, None, format4)
worksheet6.set_row(5, None, format4)
worksheet6.set_row(6, None, format4)
worksheet6.set_row(7, None, format4)
worksheet6.set_row(8, None, format4)
worksheet6.set_row(9, None, format4)
worksheet6.set_row(10, None, format4)
worksheet6.set_row(11, None, format4)
worksheet6.set_row(12, None, format4)
worksheet6.set_row(13, None, format4)
worksheet6.set_row(14, None, format4)
worksheet6.set_row(15, None, format4)
worksheet6.set_row(16, None, format4)
worksheet6.set_row(17, None, format4)
worksheet6.set_row(18, None, format4)
worksheet6.set_row(19, None, format4)
worksheet6.set_row(20, None, format4)

worksheet7.set_column('A:A', 10)
worksheet7.set_column('B:E', 18)
worksheet7.set_row(1, None, format3)
worksheet7.set_row(2, None, format4)
worksheet7.set_row(3, None, format4)
worksheet7.set_row(4, None, format4)
worksheet7.set_row(5, None, format4)
worksheet7.set_row(6, None, format4)
worksheet7.set_row(7, None, format4)
worksheet7.set_row(8, None, format4)
worksheet7.set_row(9, None, format4)

worksheet8.set_column('A:A', 10)
worksheet8.set_column('B:E', 18)
worksheet8.set_row(1, None, format3)
worksheet8.set_row(2, None, format4)
worksheet8.set_row(3, None, format4)
worksheet8.set_row(4, None, format4)
worksheet8.set_row(5, None, format4)
worksheet8.set_row(6, None, format4)
worksheet8.set_row(7, None, format4)
worksheet8.set_row(8, None, format4)
worksheet8.set_row(9, None, format4)
worksheet8.set_row(10, None, format4)
worksheet8.set_row(11, None, format4)
worksheet8.set_row(12, None, format4)
worksheet8.set_row(13, None, format4)
worksheet8.set_row(14, None, format4)
worksheet8.set_row(15, None, format4)
worksheet8.set_row(16, None, format4)
worksheet8.set_row(17, None, format4)
worksheet8.set_row(18, None, format4)
worksheet8.set_row(19, None, format4)
worksheet8.set_row(20, None, format4)
worksheet8.set_row(21, None, format4)
worksheet8.set_row(22, None, format4)
worksheet8.set_row(23, None, format4)
worksheet8.set_row(24, None, format4)
worksheet8.set_row(25, None, format4)
worksheet8.set_row(26, None, format4)
worksheet8.set_row(27, None, format4)
worksheet8.set_row(28, None, format4)
worksheet8.set_row(29, None, format4)
worksheet8.set_row(30, None, format4)
worksheet8.set_row(31, None, format4)
worksheet8.set_row(32, None, format4)
worksheet8.set_row(33, None, format4)
worksheet8.set_row(34, None, format4)
worksheet8.set_row(35, None, format4)
worksheet8.set_row(36, None, format4)
worksheet8.set_row(37, None, format4)
worksheet8.set_row(38, None, format4)
worksheet8.set_row(39, None, format4)
worksheet8.set_row(40, None, format4)
worksheet8.set_row(41, None, format4)
worksheet8.set_row(42, None, format4)
worksheet8.set_row(43, None, format4)
worksheet8.set_row(44, None, format4)
worksheet8.set_row(45, None, format4)
worksheet8.set_row(46, None, format4)
worksheet8.set_row(47, None, format4)
worksheet8.set_row(48, None, format4)
worksheet8.set_row(49, None, format4)
worksheet8.set_row(50, None, format4)
worksheet8.set_row(51, None, format4)
worksheet8.set_row(52, None, format4)
worksheet8.set_row(53, None, format4)
worksheet8.set_row(54, None, format4)
worksheet8.set_row(55, None, format4)
worksheet8.set_row(56, None, format4)
worksheet8.set_row(57, None, format4)

#dont write until you check the code then remove the # below
writer.save()